# 2D列表、巢狀迴圈
# row = 行
# coumn = 列

# 1.一維列表
num1 = [0,1,2,3,4]   

# 2.二維列表
num2 = [[0,1,2], [4,5,8], [8,4,2]]   

# 3-1 二維列表 {4行(row),3列(col)}
num3 = [
    [0,1,2], 
    [3,4,5], 
    [6,7,8],
    [9]
]   

#3-2 如果想要取二維列表中的值
print(num3 [0][0])  #第一個裝括號代表第幾行，第二個中括號代表第幾列
print(num3 [1][2]) # 會得到5



#3-3 如果像要印出二維列表裡面的每一個值的話，需要利用巢狀迴圈
for row in num3:    #將num3裡的4行分別放入row 
    for col in row:     #將row(每一行)裡的每一列(3列)分別放入col 
        print(col)


#4. 三圍列表(會有三個中括號)
num4 = [
    [[0,1,2]],  
    [3,4,5], 
    [6,7,8],
    [9]
]   
print(num4 [0][0][2])  #會得到2